//****************************************************************
//功能:定时器计数器A,2路PWM波产生波形
//****************************************************************
#include <msp430x14x.h>
#include "Config.h"

//****************************************************************
//功能:IO初始化
//****************************************************************
//IO初始化
//****************************************************************
//功能:定时器计数器A,2路PWM波产生波形
//****************************************************************
void TAPWM()
{ 
  /*********************d第一路PWM波********************
  // P1SEL|=BIT3;//TA2从P1.3输出
  // P1DIR|=BIT3; //TA2从P1.3输出
  //TACCTL0=OUTMOD_7;//模式7高电平PWM输出PWM设置 
  // TACCR2=16;//TA2占空比=16/32=50%
  //TACCTL2=OUTMOD_7;//模式7高电平PWM输出
  /*********************d第二路PWM波********************/
  P1SEL|=BIT2;//TA1从P1.2输出
  P1DIR|=BIT2;//TA1从P1.2输出
  TACTL|=MC_1+TASSEL_2+ID_3;//时钟源选择ACLK，增计数模式TA设置 
  TACCTL1=OUTMOD_7;//模式7高电平PWM输出PWM设置
  TACCR0=100;//PWM总周期=32个ACLK周期约等于1000Hz设置PWM的周期
  TACCR1=80;//TA1占空比=16/32=50%设置占空比
}

void Clock_Init()
{
  uchar i;

  BCSCTL2|=SELM_1 + SELM_0 + SELS;    //MCLK为32.768KHZ，SMCLK为8MHZ
  do{
    IFG1&=~OFIFG;                   //清楚振荡器错误标志
    for(i=0;i<100;i++)
       _NOP();
  }
  while((IFG1&OFIFG)!=0);           //如果标志位1，则继续循环等待
  IFG1&=~OFIFG; 
}

//***********************************************************************
//               MSP430内部看门狗初始化
//***********************************************************************
void WDT_Init()
{
   WDTCTL = WDTPW + WDTHOLD;       //关闭看门狗
}
//***********************************************************************
//      主程序
//***********************************************************************
void main(void)
{   
     //P6SEL|=~BIT0;//
     P6DIR|=BIT0;//     P6DIR&=~BIT0;//
     WDT_Init();                         //看门狗设置
     Clock_Init();                       //系统时钟
     while (1) 
     {  
        TAPWM();
      }
}
