#include <msp430x14x.h>
#include"Config.h"   //配置头文件
unsigned char F_Rotation[8]={0x08,0x0c,0x04,0x06,0x02,0x03,0x01,0x09};//正转表格
unsigned char B_Rotation[8]={0x09,0x01,0x03,0x02,0x02,0x06,0x0c,0x08};//反转表格
//*************************************************************************
//			初始化IO口子程序
//*************************************************************************
void Port_init()
{
    P2SEL = 0x00;                   //P2口作为AD数据口
    P2DIR = 0xFF;                   //P2为输出方向IO
}

//**********************步进电机正转******************************
void motor_ffw(unsigned int n)
{
  unsigned char a;
  unsigned int s;
  for(s=0;s<8*64*n;s++)
  {
    for(a=0;a<8;a++)
    {
      P2OUT=F_Rotation[a];  //输出对应的相 可以自行换成反转表格
      delay_ms(1);        //改变这个参数可以调整电机转速
    }
  }
  while(1);
  P2OUT=0XFF;  //STOP
}
//***********************************************************************
//      主程序
//***********************************************************************
void main(void)
{    
     WDT_Init();                         //看门狗设置
     Clock_Init();                       //系统时钟设置
     Port_init();                        //系统初始化，设置IO口属性  
     while(1)
     {
       motor_ffw(100);
      }
  }


